package by.epam.modul1.part3;

/* C помощью оператора while напишите программу вывода всех четных чисел в диапазоне 
 * от 2 до 100 включительно.*/

public class Zadacha4 {

	public static void main(String[] args) {
		int x;
		x = 2;
		while (x <= 100) {
			x = x + 2;
			System.out.println(x);

		}

	}

}
